In [1]:
import pandas as pd
import numpy as np
import env

**Use your function to obtain a connection to the employees database.**

In [2]:
pd.read_sql('select * from employees limit 5', env.url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

**Once you have successfully run a query:**
* Intentionally make a typo in the database url. What kind of error message do you see?

In [3]:
pd.read_sql('select * from employees limit 5', env.urll)
#has no attribute

AttributeError: module 'env' has no attribute 'urll'

* Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
pd.read_sql('select * from employees limitt 5', env.url)
#programming error

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5' at line 1")
[SQL: select * from employees limitt 5]
(Background on this error at: https://sqlalche.me/e/14/f405)

**Read the employees and titles tables into two separate DataFrames.**

In [11]:
employees = pd.read_sql('select * from employees', env.url)
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [10]:
titles = pd.read_sql('select * from titles', env.url)
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

**How many rows and columns do you have in each DataFrame? Is that what you expected?**

In [12]:
print(employees.shape)
print(titles.shape)
#titles was expected to be larger since one employee could have help multiple titles over their career at the company

(300024, 6)
(443308, 4)

**Display the summary statistics for each DataFrame.**

In [20]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [21]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

**How many unique titles are in the titles DataFrame?**

In [25]:
unique_titles = pd.read_sql('''SELECT 
	title
FROM titles
group by title''', env.url)

unique_titles.nunique()

title    7
dtype: int64

**What is the oldest date in the to_date column?**

In [32]:
oldest_date = pd.read_sql('''SELECT 
	*
FROM titles
order by to_date
limit 1''', env.url)

oldest_date.to_date

0    1985-03-01
Name: to_date, dtype: object

**What is the most recent date in the to_date column?**

In [33]:
recent_date = pd.read_sql('''SELECT 
	*
FROM titles
where to_date < '9999-01-01'
order by to_date DESC
limit 1''', env.url)

recent_date.to_date

0    2002-08-01
Name: to_date, dtype: object